Sainero/CubeProjectmodem/Cleanrykami/STM32CubeExpansion_LRWAN_V2.0.0/Projects/B-L072Z-LRWAN1/Applications/LoRaWAN/LoRaWAN_End_Node/LoRaWAN/App/lora_app.c
  /* EnvSensors_Read(&sensor_data);
  #if defined (SENSOR_ENABLED) && (SENSOR_ENABLED == 1)

    temperature = (int16_t) sensor_data.temperature;

  #else
   temperature = (SYS_GetTemperatureLevel() >> 8);
  #endif  /* SENSOR_ENABLED */
  /*  pressure    = (uint16_t)(sensor_data.pressure * 100 / 10);      /* in hPa / 10 */

    AppData.Port = LORAWAN_USER_APP_PORT;
    /*
#ifdef CAYENNE_LPP
  CayenneLppReset();
  CayenneLppAddBarometricPressure(channel++, pressure);
  CayenneLppAddTemperature(channel++, temperature);
  CayenneLppAddRelativeHumidity(channel++, (uint16_t)(sensor_data.humidity));

  if ((LmHandlerParams.ActiveRegion != LORAMAC_REGION_US915) && (LmHandlerParams.ActiveRegion != LORAMAC_REGION_AU915)
      && (LmHandlerParams.ActiveRegion != LORAMAC_REGION_AS923))
  {
    CayenneLppAddDigitalInput(channel++, GetBatteryLevel());
    CayenneLppAddDigitalOutput(channel++, AppLedStateOn);
  }

  CayenneLppCopy(AppData.Buffer);
  AppData.BufferSize = CayenneLppGetSize();
#else  /* not CAYENNE_LPP */
    /*  humidity    = (uint16_t)(sensor_data.humidity * 10);            /* in %*10     */

  // AppData.Buffer[i++] = AppLedStateOn; //////////////////////////////// ДАЁТ 00 В НАЧАЛЕ
    /*  AppData.Buffer[i++] = (uint8_t)((pressure >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(pressure & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(temperature & 0xFF);
  AppData.Buffer[i++] = (uint8_t)((humidity >> 8) & 0xFF);
  AppData.Buffer[i++] = (uint8_t)(humidity & 0xFF);

  //AppData.Buffer[i++] = (uint8_t)(temperature & 0xFF);
   */
  // payload == "text";
  // AppData.Buffer[i++] = payload;
  // BMP280_HandleTypedef bmp280;
  // LmHandlerGetDevAddr = i;
// HAL_I2C_GetState(&hi2c1);
 // HAL_I2C_Master_Receive(&bmp280);
	 // I2C_DMAMasterReceiveCplt(DMA_HandleTypeDef *hdma)
		//HAL_I2C_GetState;
  // __B_L072Z_LRWAN1_BSP_VERSION_MAIN = i;
  // bmp280_init_default_params(&bmp280.params);
  //  bmp280.addr = BMP280_I2C_ADDRESS_0;
  //
  // MX_I2C1_Init();
 // MX_USART2_Init();
  // MX_I2C1_Init();
  // BSP_SPI1_Init();
  BSP_I2C1_Init();
  // MX_USART1_Init();
  //MX_LPTIM1_Init();

  // MX_I2C1_Init();
 // HAL_I2C_GetState;// cntGetValue(&Defbuff);  // здесь будет сбор значения вскрытий// HTS221_Init(pObj);//HTS221_GetCapabilities(pObj, Capabilities);  //  HAL_LPTIM_Counter_Start_IT(&hlptim1,1000);
  // HAL_LPTIM_Counter_Start_IT(&hlptim1,1000);
    //	  HAL_Delay(200);  //	UTIL_TIMER_Create(&ReadLedTimer, 0xFFFFFFFFU, UTIL_TIMER_PERIODIC, OnJoinTimerLedEvent, NULL);  // UTIL_TIMER_SetPeriod(&ReadLedTimer, 5000);  	//UTIL_TIMER_Create(&RxLedTimer, 0xFFFFFFFFU, UTIL_TIMER_ONESHOT, OnRxTimerLedEvent, NULL);
  bmp280_init_default_params(&bmp280.params);
    	bmp280.addr = BMP280_I2C_ADDRESS_0;
    	bmp280.i2c = &hi2c1;
    	bmp280_init(&bmp280, &bmp280.params);
    	 //size = sprintf((char *)Data, "BMP280 initialization failed\n");
    	 // HAL_UART_Transmit(&husart2, Data, size, 1000);
    	 //HAL_Delay(200);
    	//		bool bme280p = bmp280.id == BME280_CHIP_ID;
    	   	 //	size = sprintf((char *)Data, "BMP280: found %s\n", bme280p ? "BME280" : "BMP280");
    	// 	HAL_UART_Transmit(&husart2, Data, size, 1000);

    	/*	while (!bmp280_init(&bmp280, &bmp280.params)) {
    			size = sprintf((char *)Data, "BMP280 initialization failed\n");
    			 HAL_UART_Transmit(&huart2, Data, size, 1000);
    			HAL_Delay(200);
    		}
        */
    	// HTS221_Init(&hts221);
    	 // HTS221_GetCapabilities(&hts221, temperature);
  // bmp280.i2c = &hi2c1;
   // bmp280_read_float(&bmp280, &temperature1, &pressure1, &humidity1);
  //  bmp280_read_float(&bmp280, &temperature1, &pressure1, &humidity1); старое
    	// HAL_Delay(100);
    	 bmp280_read_float(&bmp280, &temperature1, &pressure1, &humidity1);
    	 numberdev = 0x01;  // new
    	 per = 0xA; // new
  // bool bme280p = bmp280.id == BME280_CHIP_ID;
 // size = (temperature1, pressure1, humidity1);
    size = (temperature1, pressure1, humidity1);
    size = sprintf((char *)Data, "BMP280 initialization failed\n");
    //    size = (Capabilities);
    // size = sprintf((char *)Data,
    //	  					"%d:%d:%d\n", (int)temperature,(int)pressure,(int)humidity);
    // printf("IDDDDDDDDDDD 2\n\r");
    //snprintf("IDDDDDDDDDDD 2\n\r");
    // vprintf(size);
    // putchar("IDDDDDDDDDDD 2\n\r");

    //   HAL_UART_Transmit(&husart1, Data, size, 1000);
    // HAL_UART_Transmit(&husart1, Data, size, 1000);'
    // HAL_UART_Transmit_DMA(&husart1, Daata, size, 1000);
    // HAL_UART_Transmit_DMA(&husart1, Daata, size, 1000);
    //   HAL_Delay(200);

  // HAL_I2C_Master_Receive(&hi2c1, size);
  //  bmp280_read_float(&bme280p, &temperature1, &pressure1, &humidity1);
    //dev
 // LmHandlerAppData_t *appData, LmHandlerRxParams_t *params):
  // for i = setbuf(AppData.Buffer, 51);
  // AppData.Buffer[i++] = temperature1;// 1  варик
  // AppData.Buffer[i++] = ((pressure1 >> 8) & 0xFF);
  // AppData.Buffer[i++] = 0x02;
  // for (i = 0; i <= 50; i++)  ||Cчётчик
  // pressure1 = (uint16_t)(params.oversampling_pressure * 10);

    //    AppData.Buffer[i++] = ((pressure1 >> 8) & 0xFF);
    // humidity1 = (uint16_t)(params.oversampling_humidity * 10);
    // humidity1 = (uint16_t)(bmp280_params_t).oversampling_humidity * 10;
    // humidity1 = (uint16_t)(params.oversampling_humidity * 10);
    // pressure1 = (uint16_t)(params.oversampling_pressure * 10);
    //temperature1 = (uint16_t)(params.oversampling_temperature * 10);
  // temperature1 = 0x02;
  // AppData.Buffer[i++] = (uint16_t)pressure1 >> 1 ;
  // AppData.Buffer[i++] = (uint8_t)temperature1 >> 8 ;
  //  AppData.Buffer[i++] = (int)humidity1 >> 16;


    //AppData.Buffer[i++] = 0x00;
    AppData.Buffer[i++] = numberdev; // new номер устройства
  AppData.Buffer[i++] = temperature1;
  AppData.Buffer[i++] = humidity1;
  AppData.Buffer[i++] = per; // new период включения прибора
  // AppData.Buffer[i++] = BAT_CR2032; // new заряд батареи, CR2032 старая батарейка, новая LS14500
  // SYS_GetBatteryLevel(); // new заряд батареи
  // GetBatteryLevel(); // new заряд батареи
  // AppData.Buffer[i++] = batteryLevel; // new заряд батареи
  AppData.Buffer[i++] = GetBatteryLevel();
  // AppData.Buffer[i++] = Capabilities;

